author: smthdfirent
date: 2024/05/29
modified: 2024/5/29

title: 'Defender Sample Submitted (Informational)'
description: 'Windows defender uploaded a sample for analysis'

id: 21886695-34cc-4453-8b7a-79b2fb1384a7
level: informational
status: experimental
logsource:
    product: windows
    service: windefend
detection:
    selection:
        Channel: Microsoft-Windows-Windows Defender/Operational
        EventID: 2050
    condition: selection
falsepositives:
    - benign sample
tags:
    - malware
references:
    - https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide (currently not document here)
ruletype: Hayabusa